import styles from './Footer.module.scss';
import cn from 'classnames';
import NavLink from 'components/NavLink/NavLink';

function Footer() {
    return (
        <footer className={styles.footer}>
            <div className={styles.container}>
                <div className={styles.wrapper}>
                    <div className={styles.app}>
                        <div className={styles.logo}>
                            <NavLink to={'/'} aria-label="Hunted">
                                <img src="images/logo/logo.svg" alt="logo" />
                            </NavLink>
                        </div>
                        <span className={styles.app_text}>
                            Кинолифт | Hunted <br /> Это больше, чем просто поиск работы в кино
                        </span>
                    </div>
                    <div className={styles.links}>
                        <div className={cn(styles.item, styles.users)}>
                            <div className={styles.item_title}>Возможности</div>
                            <NavLink to={'/'} className={styles.item_link}>
                                Работодателям
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Соискателям
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Создать резюме
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Разместить вакансию
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Тарифные планы
                            </NavLink>
                        </div>
                        <div className={cn(styles.item, styles.socials)}>
                            <div className={styles.item_title}>Категории</div>
                            <NavLink to={'/'} className={styles.item_link}>
                                Кино транспорт
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Костюмы и реквизит
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Аренда объектов
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Аренда техники
                            </NavLink>
                        </div>
                        <div className={cn(styles.item, styles.contacts)}>
                            <div className={styles.item_title}>Поддержка</div>
                            <NavLink to={'/'} className={styles.item_link}>
                                FAQ
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Блог
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Лицензирование
                            </NavLink>
                            <NavLink to={'/'} className={styles.item_link}>
                                Обратная связь
                            </NavLink>
                        </div>
                    </div>
                </div>
                <div className={styles.bottom}>
                    <div className={styles.bottom_left}>
                        <span>© 2022 Kinolift Global. All Rights Reserved</span>
                    </div>
                    <div className={styles.bottom_right}>
                        <div className={styles.bottom_right_rules}>
                            <NavLink to={'/'} className={styles.bottom_link}>
                                <span>Правила сервиса</span>
                            </NavLink>
                            <NavLink to={'/'} className={styles.bottom_link}>
                                <span>Политика конфиденциальности</span>
                            </NavLink>
                        </div>

                        <div className={styles.bottom_right_social}>
                            <NavLink
                                aria-label="facebook"
                                className={styles.bottom_right_social_link}
                                to={'https://www.facebook.com/help/568137493302217'}
                                rel="external nofollow noopener"
                            >
                                <svg
                                    width="24"
                                    height="24"
                                    viewBox="0 0 24 24"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        fillRule="evenodd"
                                        clipRule="evenodd"
                                        d="M12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0ZM13.2539 12.5271V19.0557H10.5527V12.5274H9.20312V10.2776H10.5527V8.92678C10.5527 7.0914 11.3147 6 13.4797 6H15.2822V8.25006H14.1555C13.3127 8.25006 13.257 8.56447 13.257 9.15125L13.2539 10.2773H15.2949L15.0561 12.5271H13.2539Z"
                                        fill="#607D8B"
                                    />
                                </svg>
                            </NavLink>
                            <NavLink
                                aria-label="instagram"
                                className={styles.bottom_right_social_link}
                                to={'https://www.instagram.com/kinolift/'}
                                target="_blank"
                                rel="external nofollow noopener noreferrer"
                            >
                                <svg
                                    width="24"
                                    height="24"
                                    viewBox="0 0 24 24"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        fillRule="evenodd"
                                        clipRule="evenodd"
                                        d="M12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0ZM9.3632 5.63876C10.0459 5.6077 10.264 5.6001 12.0022 5.6001H12.0002C13.7388 5.6001 13.9562 5.6077 14.6389 5.63876C15.3202 5.66997 15.7855 5.77783 16.1935 5.9361C16.6149 6.09944 16.9709 6.31811 17.3269 6.67411C17.6829 7.02985 17.9016 7.38692 18.0656 7.80785C18.2229 8.21479 18.3309 8.67986 18.3629 9.3612C18.3936 10.0439 18.4016 10.262 18.4016 12.0002C18.4016 13.7383 18.3936 13.9559 18.3629 14.6386C18.3309 15.3197 18.2229 15.7849 18.0656 16.1919C17.9016 16.6127 17.6829 16.9698 17.3269 17.3256C16.9713 17.6816 16.6147 17.9008 16.1939 18.0642C15.7867 18.2225 15.3211 18.3304 14.6398 18.3616C13.9571 18.3926 13.7396 18.4002 12.0014 18.4002C10.2633 18.4002 10.0453 18.3926 9.36267 18.3616C8.68146 18.3304 8.21626 18.2225 7.80905 18.0642C7.38838 17.9008 7.03131 17.6816 6.67571 17.3256C6.31984 16.9698 6.10117 16.6127 5.93757 16.1918C5.77943 15.7849 5.67156 15.3198 5.64023 14.6385C5.6093 13.9558 5.60156 13.7383 5.60156 12.0002C5.60156 10.262 5.60956 10.0437 5.6401 9.36107C5.67076 8.68 5.77876 8.21479 5.93743 7.80772C6.10143 7.38692 6.3201 7.02985 6.67611 6.67411C7.03184 6.31824 7.38891 6.09957 7.80985 5.9361C8.21679 5.77783 8.68186 5.66997 9.3632 5.63876Z"
                                        fill="#607D8B"
                                    />
                                    <path
                                        fillRule="evenodd"
                                        clipRule="evenodd"
                                        d="M11.4226 6.75306C11.5341 6.75289 11.654 6.75294 11.7834 6.753L11.9967 6.75306C13.7055 6.75306 13.9081 6.7592 14.5829 6.78987C15.2069 6.8184 15.5456 6.92267 15.7712 7.01027C16.0698 7.12627 16.2828 7.26494 16.5066 7.48894C16.7306 7.71294 16.8693 7.92628 16.9856 8.22495C17.0732 8.45028 17.1776 8.78895 17.206 9.41296C17.2366 10.0876 17.2433 10.2903 17.2433 11.9983C17.2433 13.7063 17.2366 13.909 17.206 14.5837C17.1774 15.2077 17.0732 15.5464 16.9856 15.7717C16.8696 16.0704 16.7306 16.283 16.5066 16.5069C16.2826 16.7309 16.07 16.8696 15.7712 16.9856C15.5458 17.0736 15.2069 17.1776 14.5829 17.2061C13.9082 17.2368 13.7055 17.2434 11.9967 17.2434C10.2878 17.2434 10.0852 17.2368 9.41056 17.2061C8.78655 17.1773 8.44788 17.073 8.22215 16.9854C7.92348 16.8694 7.71014 16.7308 7.48614 16.5068C7.26214 16.2828 7.12347 16.07 7.0072 15.7712C6.9196 15.5458 6.8152 15.2072 6.7868 14.5831C6.75613 13.9085 6.75 13.7058 6.75 11.9967C6.75 10.2876 6.75613 10.086 6.7868 9.41136C6.81533 8.78735 6.9196 8.44868 7.0072 8.22308C7.1232 7.92441 7.26214 7.71107 7.48614 7.48707C7.71014 7.26307 7.92348 7.1244 8.22215 7.00813C8.44775 6.92013 8.78655 6.81613 9.41056 6.78747C10.001 6.7608 10.2298 6.7528 11.4226 6.75146V6.75306ZM15.4164 7.8157C14.9924 7.8157 14.6484 8.1593 14.6484 8.58344C14.6484 9.00744 14.9924 9.35145 15.4164 9.35145C15.8405 9.35145 16.1845 9.00744 16.1845 8.58344C16.1845 8.15943 15.8405 7.81543 15.4164 7.81543V7.8157ZM8.71094 11.9996C8.71094 10.1845 10.1825 8.71296 11.9975 8.71289C13.8126 8.71289 15.2838 10.1845 15.2838 11.9996C15.2838 13.8147 13.8127 15.2856 11.9976 15.2856C10.1826 15.2856 8.71094 13.8147 8.71094 11.9996Z"
                                        fill="#607D8B"
                                    />
                                    <path
                                        fillRule="evenodd"
                                        clipRule="evenodd"
                                        d="M12.0005 9.8667C13.1787 9.8667 14.1339 10.8218 14.1339 12.0001C14.1339 13.1782 13.1787 14.1334 12.0005 14.1334C10.8223 14.1334 9.86719 13.1782 9.86719 12.0001C9.86719 10.8218 10.8223 9.8667 12.0005 9.8667V9.8667Z"
                                        fill="#607D8B"
                                    />
                                </svg>
                            </NavLink>
                            <NavLink
                                aria-label="vk"
                                to={'https://vk.com/kinoliftworld'}
                                className={styles.bottom_right_social_link}
                                rel="external nofollow noopener noreferrer"
                            >
                                <svg
                                    width="24"
                                    height="24"
                                    viewBox="0 0 24 24"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg"
                                >
                                    <path
                                        fillRule="evenodd"
                                        clipRule="evenodd"
                                        d="M12 0C5.37258 0 0 5.37258 0 12C0 18.6274 5.37258 24 12 24C18.6274 24 24 18.6274 24 12C24 5.37258 18.6274 0 12 0ZM12.9708 15.7879C12.8525 15.9126 12.6215 15.9378 12.6215 15.9378H11.8565C11.8565 15.9378 10.1686 16.0374 8.68176 14.5183C7.06029 12.8609 5.62852 9.57257 5.62852 9.57257C5.62852 9.57257 5.54588 9.35687 5.63541 9.25302C5.7362 9.13564 6.01104 9.12827 6.01104 9.12827L7.83972 9.11659C7.83972 9.11659 8.01189 9.14425 8.13522 9.23335C8.23726 9.3071 8.29423 9.44414 8.29423 9.44414C8.29423 9.44414 8.58973 10.1779 8.98101 10.8416C9.74541 12.1376 10.101 12.4209 10.3602 12.282C10.7383 12.0798 10.625 10.4501 10.625 10.4501C10.625 10.4501 10.6319 9.85894 10.4347 9.59531C10.2819 9.39129 9.99396 9.33168 9.86687 9.31509C9.76357 9.30157 9.9326 9.06682 10.1517 8.96173C10.481 8.8038 11.062 8.79458 11.7488 8.80134C12.284 8.80687 12.438 8.83944 12.6471 8.88922C13.1324 9.00417 13.1173 9.37257 13.0846 10.1676C13.0748 10.4054 13.0635 10.6814 13.0635 11.0001C13.0635 11.0717 13.0613 11.1481 13.0592 11.2266C13.0478 11.634 13.0348 12.1004 13.3083 12.274C13.4485 12.3625 13.7909 12.2869 14.648 10.8588C15.0543 10.1816 15.3586 9.38576 15.3586 9.38576C15.3586 9.38576 15.4256 9.2438 15.5289 9.18296C15.6347 9.1209 15.7774 9.13995 15.7774 9.13995L17.7019 9.12827C17.7019 9.12827 18.2803 9.06006 18.3736 9.31693C18.4719 9.58548 18.1576 10.2135 17.3713 11.2422C16.6254 12.2183 16.2624 12.5777 16.2958 12.8956C16.3201 13.1278 16.5561 13.3379 17.0088 13.7501C17.954 14.6115 18.2074 15.0647 18.2683 15.1736C18.2733 15.1827 18.277 15.1893 18.2797 15.1937C18.7035 15.8838 17.8095 15.9378 17.8095 15.9378L16.0998 15.9612C16.0998 15.9612 15.7329 16.0325 15.2496 15.7068C14.9965 15.5363 14.7491 15.2579 14.5134 14.9927C14.1536 14.5877 13.8211 14.2136 13.5374 14.302C13.061 14.4507 13.0754 15.4579 13.0754 15.4579C13.0754 15.4579 13.0791 15.6736 12.9708 15.7879Z"
                                        fill="#607D8B"
                                    />
                                </svg>
                            </NavLink>
                        </div>
                    </div>
                </div>
            </div>
        </footer>
    );
}

export default Footer;
